## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/22185afd-0166-42f5-88a5-a219682f51f1/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aca_env.azurerm_container_app_environment.env will be created
  + resource "azurerm_container_app_environment" "env" {
      + custom_domain_verification_id               = (known after apply)
      + dapr_application_insights_connection_string = (sensitive value)
      + default_domain                              = (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      + id                                          = (known after apply)
      + infrastructure_subnet_id                    = (known after apply)
      + internal_load_balancer_enabled              = false
      + location                                    = "australiaeast"
      + log_analytics_workspace_id                  = (known after apply)
      + mutual_tls_enabled                          = false
      + name                                        = "env-biotrackr-prod-ae"
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      + resource_group_name                         = "rg-biotrackr-prod-ae"
      + static_ip_address                           = (known after apply)
      + tags                                        = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                     = true
    }

  # module.aca_subnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "infrastructure-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-biotrackr-prod-ae"
      + virtual_network_name                           = "vnet-biotrackr-prod-ae"
    }

  # module.ai.azurerm_application_insights.ai will be created
  + resource "azurerm_application_insights" "ai" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "australiaeast"
      + name                                  = "ai-biotrackr-prod-ae"
      + resource_group_name                   = "rg-biotrackr-prod-ae"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + workspace_id                          = (known after apply)
    }

  # module.law.azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "australiaeast"
      + name                            = "law-biotrackr-prod-ae"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-biotrackr-prod-ae"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + workspace_id                    = (known after apply)
    }

  # module.resource_group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "rg-biotrackr-prod-ae"
      + tags     = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "vnet-biotrackr-prod-ae"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.aca_env.azurerm_container_app_environment.env will be created%0A  + resource "azurerm_container_app_environment" "env" {%0A      + custom_domain_verification_id               = (known after apply)%0A      + dapr_application_insights_connection_string = (sensitive value)%0A      + default_domain                              = (known after apply)%0A      + docker_bridge_cidr                          = (known after apply)%0A      + id                                          = (known after apply)%0A      + infrastructure_subnet_id                    = (known after apply)%0A      + internal_load_balancer_enabled              = false%0A      + location                                    = "australiaeast"%0A      + log_analytics_workspace_id                  = (known after apply)%0A      + mutual_tls_enabled                          = false%0A      + name                                        = "env-biotrackr-prod-ae"%0A      + platform_reserved_cidr                      = (known after apply)%0A      + platform_reserved_dns_ip_address            = (known after apply)%0A      + resource_group_name                         = "rg-biotrackr-prod-ae"%0A      + static_ip_address                           = (known after apply)%0A      + tags                                        = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + zone_redundancy_enabled                     = true%0A    }%0A%0A  # module.aca_subnet.azurerm_subnet.subnet will be created%0A  + resource "azurerm_subnet" "subnet" {%0A      + address_prefixes                               = [%0A          + "10.0.0.0/23",%0A        ]%0A      + default_outbound_access_enabled                = true%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "infrastructure-subnet"%0A      + private_endpoint_network_policies              = (known after apply)%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = "rg-biotrackr-prod-ae"%0A      + virtual_network_name                           = "vnet-biotrackr-prod-ae"%0A    }%0A%0A  # module.ai.azurerm_application_insights.ai will be created%0A  + resource "azurerm_application_insights" "ai" {%0A      + app_id                                = (known after apply)%0A      + application_type                      = "web"%0A      + connection_string                     = (sensitive value)%0A      + daily_data_cap_in_gb                  = (known after apply)%0A      + daily_data_cap_notifications_disabled = (known after apply)%0A      + disable_ip_masking                    = false%0A      + force_customer_storage_for_profiler   = false%0A      + id                                    = (known after apply)%0A      + instrumentation_key                   = (sensitive value)%0A      + internet_ingestion_enabled            = true%0A      + internet_query_enabled                = true%0A      + local_authentication_disabled         = false%0A      + location                              = "australiaeast"%0A      + name                                  = "ai-biotrackr-prod-ae"%0A      + resource_group_name                   = "rg-biotrackr-prod-ae"%0A      + retention_in_days                     = 90%0A      + sampling_percentage                   = 100%0A      + tags                                  = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + workspace_id                          = (known after apply)%0A    }%0A%0A  # module.law.azurerm_log_analytics_workspace.law will be created%0A  + resource "azurerm_log_analytics_workspace" "law" {%0A      + allow_resource_only_permissions = true%0A      + daily_quota_gb                  = -1%0A      + id                              = (known after apply)%0A      + internet_ingestion_enabled      = true%0A      + internet_query_enabled          = true%0A      + local_authentication_disabled   = false%0A      + location                        = "australiaeast"%0A      + name                            = "law-biotrackr-prod-ae"%0A      + primary_shared_key              = (sensitive value)%0A      + resource_group_name             = "rg-biotrackr-prod-ae"%0A      + retention_in_days               = 30%0A      + secondary_shared_key            = (sensitive value)%0A      + sku                             = "PerGB2018"%0A      + tags                            = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + workspace_id                    = (known after apply)%0A    }%0A%0A  # module.resource_group.azurerm_resource_group.rg will be created%0A  + resource "azurerm_resource_group" "rg" {%0A      + id       = (known after apply)%0A      + location = "australiaeast"%0A      + name     = "rg-biotrackr-prod-ae"%0A      + tags     = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A    }%0A%0A  # module.vnet.azurerm_virtual_network.vnet will be created%0A  + resource "azurerm_virtual_network" "vnet" {%0A      + address_space       = [%0A          + "10.0.0.0/16",%0A        ]%0A      + dns_servers         = (known after apply)%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "australiaeast"%0A      + name                = "vnet-biotrackr-prod-ae"%0A      + resource_group_name = "rg-biotrackr-prod-ae"%0A      + subnet              = (known after apply)%0A      + tags                = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>